torvalds/linux/sys/dev/usb/controller/avr32dci.c
	/* reset data toggle */
	AVR32_WRITE_4(sc, AVR32_EPTCLRSTA(ep_no), AVR32_EPTSTA_TOGGLESQ);

	/* clear stall */
	AVR32_WRITE_4(sc, AVR32_EPTCLRSTA(ep_no), AVR32_EPTSTA_FRCESTALL);

	if (ep_type == UE_BULK) {
		temp = AVR32_EPTCFG_TYPE_BULK;
	} else if (ep_type == UE_INTERRUPT) {
		temp = AVR32_EPTCFG_TYPE_INTR;
	} else {
		temp = AVR32_EPTCFG_TYPE_ISOC |
		    AVR32_EPTCFG_NB_TRANS(1);
	}
	if (ep_dir & UE_DIR_IN) {
		temp |= AVR32_EPTCFG_EPDIR_IN;
	}
	avr32dci_get_hw_ep_profile(NULL, &pf, ep_no);

	/* compute endpoint size (use maximum) */
	epsize = pf->max_in_frame_size | pf->max_out_frame_size;
	n = 0;
	while ((epsize /= 2))
		n++;
	temp |= AVR32_EPTCFG_EPSIZE(n);

	/* use the maximum number of banks supported */
	if (ep_no < 1)
		temp |= AVR32_EPTCFG_NBANK(1);
	else if (ep_no < 3)
		temp |= AVR32_EPTCFG_NBANK(2);
	else
		temp |= AVR32_EPTCFG_NBANK(3);

	AVR32_WRITE_4(sc, AVR32_EPTCFG(ep_no), temp);

	temp = AVR32_READ_4(sc, AVR32_EPTCFG(ep_no));

	if (!(temp & AVR32_EPTCFG_EPT_MAPD)) {
		device_printf(sc->sc_bus.bdev, "Chip rejected configuration\n");
	} else {
		AVR32_WRITE_4(sc, AVR32_EPTCTLENB(ep_no),
		    AVR32_EPTCTL_EPT_ENABL);
	}
}

static void
avr32dci_clear_stall(struct usb_device *udev, struct usb_endpoint *pipe)
{
	struct avr32dci_softc *sc;
	struct usb_endpoint_descriptor *ed;

	DPRINTFN(5, "pipe=%p\n", pipe);

	USB_BUS_LOCK_ASSERT(udev->bus, MA_OWNED);

	/* check mode */
	if (udev->flags.usb_mode != USB_MODE_DEVICE) {
		/* not supported */
		return;
	}
	/* get softc */
	sc = AVR32_BUS2SC(udev->bus);

	/* get endpoint descriptor */
	ed = pipe->edesc;

	/* reset endpoint */
	avr32dci_clear_stall_sub(sc,
	    (ed->bEndpointAddress & UE_ADDR),
	    (ed->bmAttributes & UE_XFERTYPE),
	    (ed->bEndpointAddress & (UE_DIR_IN | UE_DIR_OUT)));
}

usb_error_t
avr32dci_init(struct avr32dci_softc *sc)
{
	uint8_t n;

	DPRINTF("start\n");

	/* set up the bus structure */
	sc->sc_bus.usbrev = USB_REV_1_1;
	sc->sc_bus.methods = &avr32dci_bus_methods;

	USB_BUS_LOCK(&sc->sc_bus);

	/* make sure USB is enabled */
	avr32dci_mod_ctrl(sc, AVR32_CTRL_DEV_EN_USBA, 0);

	/* turn on clocks */
	(sc->sc_clocks_on) (&sc->sc_bus);

	/* make sure device is re-enumerated */
	avr32dci_mod_ctrl(sc, AVR32_CTRL_DEV_DETACH, 0);

	/* wait a little for things to stabilise */
	usb_pause_mtx(&sc->sc_bus.bus_mtx, hz / 20);

	/* disable interrupts */
	avr32dci_mod_ien(sc, 0, 0xFFFFFFFF);

	/* enable interrupts */
	avr32dci_mod_ien(sc, AVR32_INT_DET_SUSPD |
	    AVR32_INT_ENDRESET, 0);

	/* reset all endpoints */
	AVR32_WRITE_4(sc, AVR32_EPTRST, (1 << AVR32_EP_MAX) - 1);

	/* disable all endpoints */
	for (n = 0; n != AVR32_EP_MAX; n++) {
		/* disable endpoint */
		AVR32_WRITE_4(sc, AVR32_EPTCTLDIS(n), AVR32_EPTCTL_EPT_ENABL);
	}

	/* turn off clocks */

	avr32dci_clocks_off(sc);

	USB_BUS_UNLOCK(&sc->sc_bus);

	/* catch any lost interrupts */

	avr32dci_do_poll(&sc->sc_bus);

	return (0);			/* success */
}

void
avr32dci_uninit(struct avr32dci_softc *sc)
{
	uint8_t n;

	USB_BUS_LOCK(&sc->sc_bus);

	/* turn on clocks */
	(sc->sc_clocks_on) (&sc->sc_bus);

	/* disable interrupts */
	avr32dci_mod_ien(sc, 0, 0xFFFFFFFF);

	/* reset all endpoints */
	AVR32_WRITE_4(sc, AVR32_EPTRST, (1 << AVR32_EP_MAX) - 1);

	/* disable all endpoints */
	for (n = 0; n != AVR32_EP_MAX; n++) {
		/* disable endpoint */
		AVR32_WRITE_4(sc, AVR32_EPTCTLDIS(n), AVR32_EPTCTL_EPT_ENABL);
	}

	sc->sc_flags.port_powered = 0;
	sc->sc_flags.status_vbus = 0;
	sc->sc_flags.status_bus_reset = 0;
	sc->sc_flags.status_suspend = 0;
	sc->sc_flags.change_suspend = 0;
	sc->sc_flags.change_connect = 1;

	avr32dci_pull_down(sc);
	avr32dci_clocks_off(sc);

	USB_BUS_UNLOCK(&sc->sc_bus);
}

static void
avr32dci_suspend(struct avr32dci_softc *sc)
{
	/* TODO */
}

static void
avr32dci_resume(struct avr32dci_softc *sc)
{
	/* TODO */
}

static void
avr32dci_do_poll(struct usb_bus *bus)
{
	struct avr32dci_softc *sc = AVR32_BUS2SC(bus);

	USB_BUS_LOCK(&sc->sc_bus);
	avr32dci_interrupt_poll(sc);
	USB_BUS_UNLOCK(&sc->sc_bus);
}

/*------------------------------------------------------------------------*
 * avr32dci bulk support
 * avr32dci control support
 * avr32dci interrupt support
 *------------------------------------------------------------------------*/
static void
avr32dci_device_non_isoc_open(struct usb_xfer *xfer)
{
	return;
}

static void
avr32dci_device_non_isoc_close(struct usb_xfer *xfer)
{
	avr32dci_device_done(xfer, USB_ERR_CANCELLED);
}

static void
avr32dci_device_non_isoc_enter(struct usb_xfer *xfer)
{
	return;
}

static void
avr32dci_device_non_isoc_start(struct usb_xfer *xfer)
{
	/* setup TDs */
	avr32dci_setup_standard_chain(xfer);
	avr32dci_start_standard_chain(xfer);
}

static const struct usb_pipe_methods avr32dci_device_non_isoc_methods =
{
	.open = avr32dci_device_non_isoc_open,
	.close = avr32dci_device_non_isoc_close,
	.enter = avr32dci_device_non_isoc_enter,
	.start = avr32dci_device_non_isoc_start,
};

/*------------------------------------------------------------------------*
 * avr32dci full speed isochronous support
 *------------------------------------------------------------------------*/
static void
avr32dci_device_isoc_fs_open(struct usb_xfer *xfer)
{
	return;
}

static void
avr32dci_device_isoc_fs_close(struct usb_xfer *xfer)
{
	avr32dci_device_done(xfer, USB_ERR_CANCELLED);
}

static void
avr32dci_device_isoc_fs_enter(struct usb_xfer *xfer)
{
	struct avr32dci_softc *sc = AVR32_BUS2SC(xfer->xroot->bus);
	uint32_t temp;
	uint32_t nframes;
	uint8_t ep_no;

	DPRINTFN(6, "xfer=%p next=%d nframes=%d\n",
	    xfer, xfer->endpoint->isoc_next, xfer->nframes);

	/* get the current frame index */
	ep_no = xfer->endpointno & UE_ADDR;
	nframes = (AVR32_READ_4(sc, AVR32_FNUM) / 8);

	nframes &= AVR32_FRAME_MASK;

	/*
	 * check if the frame index is within the window where the frames
	 * will be inserted
	 */
	temp = (nframes - xfer->endpoint->isoc_next) & AVR32_FRAME_MASK;

	if ((xfer->endpoint->is_synced == 0) ||
	    (temp < xfer->nframes)) {
		/*
		 * If there is data underflow or the pipe queue is
		 * empty we schedule the transfer a few frames ahead
		 * of the current frame position. Else two isochronous
		 * transfers might overlap.
		 */
		xfer->endpoint->isoc_next = (nframes + 3) & AVR32_FRAME_MASK;
		xfer->endpoint->is_synced = 1;
		DPRINTFN(3, "start next=%d\n", xfer->endpoint->isoc_next);
	}
	/*
	 * compute how many milliseconds the insertion is ahead of the
	 * current frame position:
	 */
	temp = (xfer->endpoint->isoc_next - nframes) & AVR32_FRAME_MASK;

