torvalds/linux/sys/dev/usb/controller/avr32dci.c
	/*
	 * compute maximum number of TDs
	 */
	if ((xfer->endpoint->edesc->bmAttributes & UE_XFERTYPE) == UE_CONTROL) {

		ntd = xfer->nframes + 1 /* STATUS */ + 1	/* SYNC 1 */
		    + 1 /* SYNC 2 */ ;
	} else {

		ntd = xfer->nframes + 1 /* SYNC */ ;
	}

	/*
	 * check if "usbd_transfer_setup_sub" set an error
	 */
	if (parm->err)
		return;

	/*
	 * allocate transfer descriptors
	 */
	last_obj = NULL;

	/*
	 * get profile stuff
	 */
	ep_no = xfer->endpointno & UE_ADDR;
	avr32dci_get_hw_ep_profile(parm->udev, &pf, ep_no);

	if (pf == NULL) {
		/* should not happen */
		parm->err = USB_ERR_INVAL;
		return;
	}
	/* align data */
	parm->size[0] += ((-parm->size[0]) & (USB_HOST_ALIGN - 1));

	for (n = 0; n != ntd; n++) {

		struct avr32dci_td *td;

		if (parm->buf) {
			uint32_t temp;

			td = USB_ADD_BYTES(parm->buf, parm->size[0]);

			/* init TD */
			td->max_packet_size = xfer->max_packet_size;
			td->ep_no = ep_no;
			temp = pf->max_in_frame_size | pf->max_out_frame_size;
			td->bank_shift = 0;
			while ((temp /= 2))
				td->bank_shift++;
			if (pf->support_multi_buffer) {
				td->support_multi_buffer = 1;
			}
			td->obj_next = last_obj;

			last_obj = td;
		}
		parm->size[0] += sizeof(*td);
	}

	xfer->td_start[0] = last_obj;
}

static void
avr32dci_xfer_unsetup(struct usb_xfer *xfer)
{
	return;
}

static void
avr32dci_ep_init(struct usb_device *udev, struct usb_endpoint_descriptor *edesc,
    struct usb_endpoint *pipe)
{
	struct avr32dci_softc *sc = AVR32_BUS2SC(udev->bus);

	DPRINTFN(2, "pipe=%p, addr=%d, endpt=%d, mode=%d (%d,%d)\n",
	    pipe, udev->address,
	    edesc->bEndpointAddress, udev->flags.usb_mode,
	    sc->sc_rt_addr, udev->device_index);

	if (udev->device_index != sc->sc_rt_addr) {

		if ((udev->speed != USB_SPEED_FULL) &&
		    (udev->speed != USB_SPEED_HIGH)) {
			/* not supported */
			return;
		}
		if ((edesc->bmAttributes & UE_XFERTYPE) == UE_ISOCHRONOUS)
			pipe->methods = &avr32dci_device_isoc_fs_methods;
		else
			pipe->methods = &avr32dci_device_non_isoc_methods;
	}
}

static void
avr32dci_set_hw_power_sleep(struct usb_bus *bus, uint32_t state)
{
	struct avr32dci_softc *sc = AVR32_BUS2SC(bus);

	switch (state) {
	case USB_HW_POWER_SUSPEND:
		avr32dci_suspend(sc);
		break;
	case USB_HW_POWER_SHUTDOWN:
		avr32dci_uninit(sc);
		break;
	case USB_HW_POWER_RESUME:
		avr32dci_resume(sc);
		break;
	default:
		break;
	}
}

static const struct usb_bus_methods avr32dci_bus_methods =
{
	.endpoint_init = &avr32dci_ep_init,
	.xfer_setup = &avr32dci_xfer_setup,
	.xfer_unsetup = &avr32dci_xfer_unsetup,
	.get_hw_ep_profile = &avr32dci_get_hw_ep_profile,
	.xfer_stall = &avr32dci_xfer_stall,
	.set_stall = &avr32dci_set_stall,
	.clear_stall = &avr32dci_clear_stall,
	.roothub_exec = &avr32dci_roothub_exec,
	.xfer_poll = &avr32dci_do_poll,
	.set_hw_power_sleep = &avr32dci_set_hw_power_sleep,
};
